# Домашнее задание к лекции "Библиотека Pandas"

## Задание 1

Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [1]:
## Я взял самый маленький, у сайта умопомрачительная скорость скачивания)

In [2]:
import pandas as pd

In [3]:
data1 = pd.read_csv('ratings.csv')
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100836 entries, 0 to 100835
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   userId     100836 non-null  int64
 1   movieId    100836 non-null  int64
 2   rating     100836 non-null  float64
 3   timestamp  100836 non-null  int64
dtypes: float64(1), int64(3)
memory usage: 3.1 MB

In [4]:
data1.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [5]:
data2 = pd.read_csv('movies.csv')
data2.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [6]:
data = data1.merge(data2, left_on = 'movieId', right_on = 'movieId', how = 'left')

In [7]:
rating_level = 5
data[data['rating'] >= rating_level].groupby('title')['title'].agg(['count']).sort_values('count', ascending=False).head(1)

                                  count
title
Shawshank Redemption, The (1994)    153

## Задание 2

По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [8]:
data3 = pd.read_csv('power.csv')
data3.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [17]:
data3 = data3[(data3['country'] == 'Latvia') | (data3['country'] == 'Lithuania') | (data3['country'] == 'Estonia')]
data3 = data3[(data3['category'] == 4) | (data3['category'] == 12) | (['category'] == 21)]
data3 = data3[(data3['year'] >= 2005) & (data3['category'] <= 2010)]
data3 = data3[(data3['quantity'] >= 0)]
data3['quantity'].sum()

6689.0

## Задание 3

Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти):
```
https://fortrader.org/quotes
https://www.finanz.ru/valyuty/v-realnom-vremeni
```

In [21]:
page_url1 = 'https://fortrader.org/quotes'

pd.read_html(page_url1)[0]

                           Название   Цена  Изменение  Изменение(%)  Обновлено
0  EURRUB Курс евро к рублю сегодня  89.28        0.0          0.00        NaN
1       USDRUB Курс рубля к доллару  76.22        0.4          0.52        NaN

In [22]:
pd.read_html(page_url1)[1]

,Название,Цена,Изменение,Изменение(%),Обновлено
0,Нефть Brent Курс нефти сегодня,64.65,0.00,0.00,NaN
1,Нефть WTI Цены на нефть WTI,61.17,-0.07,-0.11,NaN
2,Природный газ Цена на природный газ,2.62,-0.00,-0.15,NaN
3,Кофе,120.75,0.00,0.00,NaN
4,Кукуруза,558.60,-0.40,-0.07,NaN
5,Соя,410.20,1.00,0.24,NaN
6,Хлопок,77.95,0.00,0.00,NaN

In [24]:
page_url2 = 'https://www.finanz.ru/valyuty/v-realnom-vremeni'

pd.read_html(page_url2, encoding='utf-8')[0]

,0,1,2,3,4,5,6,7,8,9,10,11
0,ММВБ,3 558,"0,9%",Nasdaq,13 480,"1,8%",Биткойн,57 453,"0,5%",USD/RUB,763775,"0,1%"
1,РТС,1 467,"0,6%",S&P500,4 020,"1,2%",Нефть,647,"1,7%",EUR/RUB,899455,"0,0%"
2,Dow,33 153,"0,5%",FTSE100,6 737,"-0,5%",Золото,1 730,"0,0%",EUR/USD,11765,"-0,1%"